## ------------------------------------------------------------
## [ 텐서 데이터의 연속성 Contiguous ]
## 메모리상에 1D형태도 연속적으로 데이터 저장됨
## stride 속성과 저장된 데이터의 관계 확인
## ------------------------------------------------------------
## 모듈로딩
import torch


## ------------------------------------------------------------
## 텐서 데이터 생성
## ------------------------------------------------------------
t1=torch.tensor([[11,22,33,44], [55,66,77,88]])

print(t1.shape, t1.ndim)
print(t1.stride(), t1.is_contiguous())
print(t1)


## ------------------------------------------------------------
## 텐서를 전치(transpose) 즉, 행 ==> 열, 열 ==> 행
## ------------------------------------------------------------
t2=t1.T  

print(t2.shape, t2.ndim)
print(t2.stride(), t2.is_contiguous())
print(t2)

## ------------------------------------------------------------
## 형태/모양 변경
## => reshape() 메서드 : 형태/모양 변경, 메모리 공유
##                      연속적이지 않은 텐서도 가능
## => view() 메서드    : 형태/모양 변경, 메모리 공유
##                      연속적인 텐서만 가능
## ------------------------------------------------------------
##  2D (4,2) ==> (1, 8)변경
t2.reshape((1,-1))

##  2D (4,2) ==> (1, 8)변경
t2.is_contiguous()
#t2.view(1, -1)

## 2D (2, 4) ==> (1, 8) 변경
t1.view(1, -1), t1.is_contiguous()