## -------------------------------------------------------
## Tensor 연산하기
## -------------------------------------------------------
## 다른 종류의 데이터로 구성된 데이터로 텐서 생성
## -------------------------------------------------------
##- 모듈로딩
import torch

##- 텐서 생성
t0 = torch.FloatTensor([[2, 3], [4, 5]])
t1 = torch.FloatTensor([[5, 2], [2, 1]])
t3 = torch.FloatTensor([10])

##- 동일 형태 텐서 연산
t2 = t0 + t1
print(t2)

t2 = t0 - t1
print(t2)

##- 다른 형태 텐서 연산
t2 = t0 + t3        # 2D + 1D
print(t2)

t2 = t0 - t3        # 2D - 1D
print(t2)